Repository: AlirezaBHD/CarAccessControl
Catalog: api/src/CarAccessControl.Application/Common/Localization/SharedResource.*.resx
Languages: ar

# Validation_Required
source: “{PropertyName}” is required.
ar: حقل “{PropertyName}” مطلوب.

# Validation_Length
source: “{PropertyName}” must be between {MinLength} and {MaxLength} characters.
ar: يجب أن يكون طول “{PropertyName}” بين {MinLength} و {MaxLength} حرفاً.

# Validation_ExactLength
source: “{PropertyName}” must be exactly {MaxLength} characters.
ar: يجب أن يتكون “{PropertyName}” من {MaxLength} حرفاً بالضبط.

# Validation_Numeric
source: “{PropertyName}” must contain only numbers.
ar: يجب أن يحتوي “{PropertyName}” على أرقام فقط.

# Property_CameraId
source: Camera ID
ar: معرف الكاميرا

# Property_VehicleName
source: Vehicle Name
ar: اسم المركبة

# Property_OwnerId
source: Owner ID
ar: معرف المالك

# Property_IsActive
source: Active Status
ar: حالة النشاط

# Property_GateName
source: Gate Name
ar: اسم البوابة

# Property_PlateNumber
source: License Plate
ar: رقم اللوحة

# Property_FrameInterval
source: Frame Interval
ar: الفاصل الزمني للإطارات

# Property_Url
source: RTSP/Stream URL
ar: رابط البث

# Property_Ip
source: IP Address
ar: عنوان IP

# Property_Location
source: Location
ar: الموقع

# Validation_GreaterThan
source: “{PropertyName}” must be greater than {ComparisonValue}.
ar: يجب أن يكون “{PropertyName}” أكبر من {ComparisonValue}.

# Validation_PlateInvalid
source: Invalid license plate format.
ar: تنسيق رقم اللوحة غير صالح.

# Validation_UrlInvalid
source: Invalid URL format.
ar: تنسيق الرابط غير صالح.

# Validation_IpInvalid
source: Invalid IP address format.
ar: تنسيق عنوان IP غير صالح.

# Validation_MaxLength
source: “{PropertyName}” must not exceed {MaxLength} characters.
ar: يجب ألا يتجاوز “{PropertyName}” {MaxLength} حرفاً.
